# generated by get_cup_sdc.py
# Date: 2023/06/20

### Note:
# - input clock transition and latency are set for wb_clk_i port.
#   If your design is using the user_clock2, update the clock constraints to reflect that and use usr_* variables.
# - IO ports are assumed to be asynchronous. If they're synchronous to the clock, update the variable IO_SYNC to 1.
#   As well, update in_ext_delay and out_ext_delay with the required I/O external delays.

#------------------------------------------#
# Pre-defined Constraints
#------------------------------------------#

# Clock network
set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA

# Set a higher limits than in lib
set_max_fanout 8 [current_design]
set_max_capacitance 0.5 [current_design]
set_max_transition 3 [current_design]
set_max_area 0
set clk_input $::env(CLOCK_PORT)
create_clock [get_ports $clk_input]  -name clk -period 10.0 -waveform {0 10.0}
set_clock_uncertainty 0.15 [get_clocks clk]
set_clock_transition 0.25 [get_clocks clk]

create_generated_clock -name clk_div_two -source {clk} -divide_by 2 [get_pins \clk_div_param_inst/_2_/Q]
